In [1]:
import pandas as pd

In [22]:

# Define a dictionary containing employee data 
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 

df = pd.DataFrame(data)

In [23]:
df["Name"]= df["Name"].str.lower()
print(df)

     Name  Age    Address Qualification
0     jai   27      Delhi           Msc
1  princi   24     Kanpur            MA
2  gaurav   22  Allahabad           MCA
3    anuj   32    Kannauj           Phd

In [24]:
# new data frame with split value columns 
df["Address"]= df["Address"].str.split("d", n = 2, expand = True)

In [25]:
df

     Name  Age   Address Qualification
0     jai   27     Delhi           Msc
1  princi   24    Kanpur            MA
2  gaurav   22  Allahaba           MCA
3    anuj   32   Kannauj           Phd

In [28]:
# creating a filter
df["Age"] = df["Age"].replace(32, "Thirty two")
filter = df["Age"] == "Thirty two"
df.where(filter).dropna()

   Name         Age  Address Qualification
3  anuj  Thirty two  Kannauj           Phd

In [30]:
filter = df["Address"] == "Delhi"
df.where(filter).dropna()

  Name Age Address Qualification
0  jai  27   Delhi           Msc